# Старт с базового образа golang
FROM golang:1.22.1-alpine

# Установка рабочей директории внутри контейнера
WORKDIR /app

# Копирование go mod и sum файлов
ADD go.mod go.sum ./

# Загрузка всех зависимостей. 
# Если зависимости не изменились, то кэш слоя docker будет использован
RUN go mod download

# Копирование исходного кода из текущей директории в рабочую директорию внутри контейнера
COPY ../ms-gateway ./

# Компиляция приложения
RUN go build -o main .

# Запуск бинарного файла
CMD ["./main"]
